BOT_JOIN_TEXT = (
    "КТО-ТО СКАЗАЛ АЛДИИИК? Чотааааааам, я прям щяс прям тут, уважайте меня, "
    "либо ходите оглядывайтесь...\n\n"
    "Него маган админка берп тстандар по хорошему ато бо бо будет вам"
)

MODERATOR_TRIGGER_TEXT = "КТО-ТО СКАЗАЛ МОДЕРАТОР?"

ALDIK_NAME_RESPONSES = (
    "не",
    "неолд",
    "бля не",
    "чтм",
    "пр",
    "да раб мой",
    "ау зянм сол",
    "ау ау",
    "айтабер",
    "м",
    "ау",
    "я жан айтабер",
)

ANON_PROMPT_TEXT = "Пиши сюда все что хочешь детка, но будь осторожен, алдик все видит...\Шучу шучу\n\nили нет..."

PRIVATE_START_TEXT = (
    "Е чотам, алдик на связи, чтм не керек боватр натуре родной?\n\n"
    "Егер анонка жазгын келсе то группада крч алдик ссылка анонка берш деп жаз или там командамен хз и коресн сосн"
)

GROUP_HELP_TEXT = (
    "Мены танмай калдындарма не зат еба дым стей алмай хелп хелп деп\n\n"
    "Барлык роднойлар колданалат:\n"
    "/help - мнау крч тупойларга\n"
    "/group_info - осы группанын анау мынауысын корстет\n"
    "/anon_link - анонга жазу ушын ссылка берем\n"
    "Фразы: 'алдик ссылка анонка берш', 'алдик ссылка', 'алдик анон' и т.п. - анонканын ссылкасын берем\n"
    "Фразы: 'алдик мен кммн', 'алдик кто я' - алдик сен кмкен айтп беред\n"
    "Фразы: 'алдик мем видо', 'алдик видо' - группага видео мем жберем\n"
    "Фразы: 'алдик мем пото', 'алдик пото' - группага фото мем жберем казакбайский\n"
    "Фразы: 'фу паршка', 'паршка' - андай сорсп тстеп кушактап жаткан чорттарга крч\n\n"
    "Тек админдарга:\n"
    "/bot_on - мены косад крч\n"
    "/bot_off - мены ошред, но ошрмеш пж умаляю\n"
    "/anon_on - анон сообтарды косады крч\n"
    "/anon_off - aнон сообтарды ошред\n"
)

PRIVATE_HELP_TEXT = (
    "Крч мены группага кос, админка бер и все рады родной дорогой\n"
    "/help - тупойларга натуре\n\n"
)
